/******************************************************************************
 *
 * GDCC
 * Structures de données du récepteur
 *
 * Version V3.1
 * Architecture modulaire
 *
 ******************************************************************************/

#ifndef TYPES_H
#define TYPES_H

#include <Arduino.h>


//======================================================
// Paquet de commande radio
//
// Reçu depuis la télécommande GDCC V3.1
//======================================================

struct RadioPacket
{
    //==================================================
    // Vitesse
    //
    // 0   = arrêt
    // 255 = vitesse maximale
    //==================================================

    uint8_t throttle;


    //==================================================
    // Direction
    //
    // 0 = marche arrière
    // 1 = marche avant
    //==================================================

    uint8_t direction;


    //==================================================
    // Arrêt d'urgence
    //
    // 0 = fonctionnement normal
    // 1 = ARU actif
    //==================================================

    uint8_t ARU;


    //==================================================
    // Eclairage
    //
    // 0 = éteint
    // 1 = allumé
    //==================================================

    uint8_t LIGHT_Value;
};


#endif